[
    {
        "title": "Exploring Non-Verbal Strategies for Initiating an HRI",
        "date": "2022-12-16",
        "slug": "icsr-approach",
        "url": "https://www.icsr2022.it/",
        "img": "images/approach.png",
        "tags": [
                "approaching",
                "gaze",
                "hri"
        ],
        "venue": "2022 International Conference on Social Robotics (ICSR)",
        "authors": [
                "francesco-vigni",
                "silvia-rossi"
        ],
        "abstract": "The growing deployment of robots in social contexts implies the need to model their behaviour as social agents. In this context, the way a robot approaches a user and eventually engages in an interaction is a crucial aspect to take into account for the acceptance of these tools.\n In this work, we explore how the approaching policy and gaze behaviours can influence the perceived intention to interact before the interaction starts. The conducted user study highlights the importance of the robot’s gaze behaviour when approaching a human with respect to its approaching behaviour. In particular, if the robot moves in the surroundings of a human, even not straightforward in their direction, but locks the gaze at them, the intention to interact is recognised clearer and faster with respect to the direct approaching of the user but with an adverse gaze."
    },
    {
        "title": "On The Emotional Transparency of a Non-Humanoid Social Robot",
        "date": "2022-12-16",
        "slug": "icsr-emotions",
        "url": "https://www.icsr2022.it/",
        "img": "images/emotion.png",
        "tags": [
                "emotion",
                "hri"
        
        ],
        "venue": "2022 International Conference on Social Robotics (ICSR)",
        "authors": [
                "francesco-vigni",
                "alessandra-rossi",
                "linda-miccio",
                "silvia-rossi"
        ],
        "abstract": "Non-anthropomorphic robots have issues in conveying internal state during a Human-Robot Interaction (HRI). A possible approach is to let robots communicate their states or intentions through emotions. However, the robot’s emotional responses are not always clearly identified by people, and it is also difficult to identify which and how many cues are most relevant in affecting people’s ability of recognition of robots’ emotions during the ongoing interaction. We involved 102 participants in an online questionnaire-based study where they rated the robot’s behaviours, designed in terms of colours, movements and sounds, according to the perceived emotions in order to identify the cues to be used for making robots more legible. The results suggest that emotional transparency can benefit from multimodal interaction. Our results underline that single modes can be capable of conveying effectively the desired emotion, and little benefit is obtained by the use of additional modes that may be not necessarily noticed by the users."
    }
]

