[
    {
        "title": "Sweet Robot O’Mine - How a Cheerful Robot Boosts Users' Performance in a Game Scenario",
        "date": "2023-08-28",
        "slug": "sweet-robot",
        "location": "Busan, Korea",
        "url": "/",
        "img": "",
        "attach":"./research/nofile.txt",
        "tags": [
                "humanoid",
                "non-verbal cues",
                "roman"
        ],
        "venue": "2023 IEEE International Conference on Robot and Human Interactive (RO-MAN)",
        "authors": [
                "francesco-vigni",
                "antonio-andriella",
                "silvia-rossi"
        ],
        "abstract": "TBD"
    },
    {
        "title": "Exploring Non-Verbal Strategies for Initiating an HRI",
        "date": "2023-02-01",
        "slug": "icsr-approach",
        "location": "Florence, Italy",
        "url": "https://link.springer.com/chapter/10.1007/978-3-031-24667-8_25",
        "img": "./images/publications/approach.png",
        "attach":"./research/ICSR_138.pdf",
        "tags": [
                "approach",
                "non-verbal cues",
                "icsr"
        ],
        "venue": "2022 International Conference on Social Robotics (ICSR)",
        "authors": [
                "francesco-vigni",
                "silvia-rossi"
        ],
        "abstract": "The growing deployment of robots in social contexts implies the need to model their behaviour as social agents. In this context, the way a robot approaches a user and eventually engages in an interaction is a crucial aspect to take into account for the acceptance of these tools.\n In this work, we explore how the approaching policy and gaze behaviours can influence the perceived intention to interact before the interaction starts. The conducted user study highlights the importance of the robot’s gaze behaviour when approaching a human with respect to its approaching behaviour. In particular, if the robot moves in the surroundings of a human, even not straightforward in their direction, but locks the gaze at them, the intention to interact is recognised clearer and faster with respect to the direct approaching of the user but with an adverse gaze."
    },
    {
        "title": "On The Emotional Transparency of a Non-Humanoid Social Robot",
        "date": "2023-02-01",
        "slug": "icsr-emotions",
        "location": "Florence, Italy",
        "url": "https://link.springer.com/chapter/10.1007/978-3-031-24667-8_26",
        "img": "./images/publications/emotion.png",
        "attach":"./research/ICSR_140.pdf",
        "tags": [
                "emotions",
                "non-humanoid",
                "icsr"
        
        ],
        "venue": "2022 International Conference on Social Robotics (ICSR)",
        "authors": [
                "francesco-vigni",
                "alessandra-rossi",
                "linda-miccio",
                "silvia-rossi"
        ],
        "abstract": "Non-anthropomorphic robots have issues in conveying internal state during a Human-Robot Interaction (HRI). A possible approach is to let robots communicate their states or intentions through emotions. However, the robot’s emotional responses are not always clearly identified by people, and it is also difficult to identify which and how many cues are most relevant in affecting people’s ability of recognition of robots’ emotions during the ongoing interaction. We involved 102 participants in an online questionnaire-based study where they rated the robot’s behaviours, designed in terms of colours, movements and sounds, according to the perceived emotions in order to identify the cues to be used for making robots more legible. The results suggest that emotional transparency can benefit from multimodal interaction. Our results underline that single modes can be capable of conveying effectively the desired emotion, and little benefit is obtained by the use of additional modes that may be not necessarily noticed by the users."
    },
    {
        "title": "The Role of Closed-Loop Hand Control in Handshaking Interactions",
        "date": "2019-01-16",
        "slug": "icra-handshake",
        "location": "Montreal, Canada",
        "url": "https://ieeexplore.ieee.org/document/8613850",
        "img": "./images/publications/hand.png",
        "attach": "./research/nofile.txt",
        "tags": [
                "handshake",
                "icra",
                "non-verbal cues"
        ],
        "venue": "2019 IEEE International Conference on Robotics and Automation (ICRA)",
        "authors": [
                "francesco-vigni",
                "espen-knopp",
                "domenico-prattichizzo",
                "monica-malvezzi"
        ],
        "abstract": "In this letter, we investigate the role of haptic feedback in human–robot handshaking by comparing different force controllers. The basic hypothesis is that in human handshaking force control there is a balance between an intrinsic (open-loop) and extrinsic (closed-loop) contributions. We use an underactuated anthropomorphic robotic hand, the Pisa/IIT hand, instrumented with a set of pressure sensors estimating the grip force applied by humans. In a first set of experiments, we ask subjects to mimic a given force profile applied by the robot hand, to understand how human perceive and are able to reproduce a handshaking force. Using the obtained results, we implement three different handshaking controllers, in which we varied the intrinsic and extrinsic contributions and in a second set of experiments, we ask participants to evaluate them in a user study. We show that a sensorimotor delay mimicking the reaction time of the central nervous system is beneficial for making interactions more human-like. Moreover, we demonstrate that humans exploit closed-loop control for handshaking. By varying the controller we show that we can change the perceived handshake quality and also influence personality traits attributed to the robot. "
    },
    {
        "title": "Familiar Acoustic Cues for Legible Service Robots",
        "date": "2022-08-31",
        "slug": "roman-roomba",
        "location": "Naples, Italy",
        "url": "https://ieeexplore.ieee.org/document/9900699",
        "img": "./images/publications/roomba.png",
        "attach": "./research/nofile.txt",
        "tags": [
                "non-verbal cues",
                "non-humanoid",
                "roman"
        ],
        "venue": "2022 IEEE International Conference on Robot and Human Interactive (RO-MAN)",
        "authors": [
                "georgios-angelopoulos",
                "francesco-vigni",
                "alessandra-rossi",
                "giuseppina-russo",
                "mario-turco",
                "silvia-rossi"
        ],
        "abstract": "When navigating in a shared environment, the extent to which robots are able to effectively use signals for coordinating with human behaviors can ameliorate dissatisfaction and increase acceptance. In this paper, we present an online video study to investigate whether familiar acoustic signals can improve the legibility of a robot’s navigation behavior. We collected the responses of 120 participants to evaluate their perceptions of a robot that communicates with one of the three used non-verbal navigational cues (an acoustic signal, an acoustic in pair with a visual signal, and a dissimilar frequency acoustic signal). Our results showed a significant legibility improvement when the robot used both light and acoustic signals to communicate its intentions compared to using only the same acoustic sound. Additionally, our findings highlighted that people also perceived differently the robot’s intentions when they were expressed through two frequencies of the mere sound. The results of this work suggest a paradigm that can help the development of mobile service robots in public spaces."
    }
]

